In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = {
        "Department":["IT","Human Resources","Production","Production","IT","Human Resources"],
        "Employee": ["Charlotte","Amelia","Kemal","Oliver","Emma","Jack"],
        "Salary":[3000,3500,2500,4500,4000,2000]
        }

In [3]:
df = pd.DataFrame(dataset)

In [4]:
df

        Department   Employee  Salary
0               IT  Charlotte    3000
1  Human Resources     Amelia    3500
2       Production      Kemal    2500
3       Production     Oliver    4500
4               IT       Emma    4000
5  Human Resources       Jack    2000

### Let's use GroupBy use this dataframe:

In [5]:
DepGroup = df.groupby("Department")

In [6]:
DepGroup #As you can see it returns "DataFrameGroupBy" object

In [10]:
DepGroup.sum() # This returns the sum of the salaries of each department

                 Salary
Department
Human Resources    5500
IT                 7000
Production         7000

In [11]:
df.groupby("Department").sum() # Short way

                 Salary
Department
Human Resources    5500
IT                 7000
Production         7000

***
### Some operations of GroupBy:

In [12]:
df.groupby("Department").sum().loc["IT"]

Salary    7000
Name: IT, dtype: int64

In [16]:
int(df.groupby("Department").sum().loc["IT"]) # If we want to see only in integer form

7000

In [19]:
df.groupby("Department").count() # Counts employees and their salaries

                 Employee  Salary
Department
Human Resources         2       2
IT                      2       2
Production              2       2

In [26]:
df.groupby("Department").max()
# This calculates maximum salary in one Department as integer, also it checks names alphabetical, because they are string, and returns biggest name
#For example in Human Resources, max salary is 3500 but Jack comes later than Amelia as alphabetical, that's why "Jack" is returned

                Employee  Salary
Department
Human Resources     Jack    3500
IT                  Emma    4000
Production        Oliver    4500

In [27]:
df.groupby("Department").min() #Same thing but returns min salary and the name which comes first as alphabetical

                  Employee  Salary
Department
Human Resources     Amelia    2000
IT               Charlotte    3000
Production           Kemal    2500

In [35]:
df.groupby("Department").min()["Salary"] # Returns min salaries of each department

Department
Human Resources    2000
IT                 3000
Production         2500
Name: Salary, dtype: int64

In [36]:
df.groupby("Department").min()["Salary"]["IT"] #Returns min salary of "IT" department

3000

In [39]:
df.groupby("Department").mean() # Returns the mean of the salaries of each department

                 Salary
Department
Human Resources    2750
IT                 3500
Production         3500

In [41]:
df.groupby("Department").mean()["Salary"]["Human Resources"] # Returns the mean of "Human Resources" department

2750